# SetIsCurtainWall

## Description
Sets whether or not a wall is a curtain wall.

```pascal
PROCEDURE SetIsCurtainWall(
				wall          : HANDLE;
				isCurtainWall : BOOLEAN);
```

```python
def vs.SetIsCurtainWall(wall, isCurtainWall):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|wall|HANDLE|The wall.|
|isCurtainWall|BOOLEAN|Whether or not the wall is a curtain wall.|

## Examples
```pascal
SetIsCurtainWall(wall, TRUE);
```
```python
import vs

# Sets whether or not a wall is a curtain wall.
wall = vs.FSActLayer()  # handle to the first selected object on the active layer
isCurtainWall = True

vs.SetIsCurtainWall(wall, isCurtainWall)
```

## See Also
VS Functions:
IsCurtainWall

## Version
Availability: from Vectorworks 2016

## Category
* Objects - Walls